"""
已知蔬果价格和数量，如何编写python程序计算需要支付的总金额。
预先设置出售的水果与相应的价格，苹果5元/斤，桃子6元/斤，香蕉3元/斤，梨子4元/斤;
输入整数n代表要购买的水果种类数量;
输入n行水果名称何购买数量;
程序计算总价格后输出到屏幕。
如果要购买的水果超市中没有，则忽略它不参与计算。
"""
"""
字典的概念与创建
对象于对象之间的对应关系，即映射。
    例如四种水果分别放在四个筐，则苹果在A筐 桃子在B筐 香蕉和梨子分别在C和D筐是它们的映射关系
    字典就是用来表示这种映射关系的结构
字典的语法：
    dict={key1:value1,key2:value2,...}
    dict表示字典名，key表示映射的键，value表示映射的值，映射关系之间用逗号分隔。
"""
# --------------------------------------------------------------

"""
# 创建水果与果筐的映射字典
container={'苹果':'A','桃子':'B','香蕉':'C','梨子':'D'}
print(container)
print(container['桃子'])
"""
# ----------------------------------------------------------------
"""
字典的创建方式
name={}或者name=dict()
向字典中添加键值对的语法：dictname[key]=value
"""
# -----------------------------------------------------------------

"""
#创建水果与价格的映射字典
price=dict()

price['苹果']=5
price['桃子']=6
price['香蕉']=3
price['梨子']=4

print(price)
"""


# 定义水果价格字典price，其中保存了苹果、桃子、香蕉、梨子的价格
price={'苹果': 5, '桃子': 6, '香蕉': 3, '梨子': 4}

# if "苹果" in price:
#     print("苹果的价格为%d"%(price["苹果"]))
# else:
#     print("该水果不卖")
#
# if "荔枝" in price:
#     print("荔枝的价格为%d"%(price["荔枝"]))
# else:
#     print("该水果不卖")
# print(price['荔枝'])

#通过循环，配合相应的信息，将字典中的水果和价格打印出来
print("今日水果价格：")
for fruit in price:
    print("%s%d元/斤"%(fruit,price[fruit]))
print("")
#输入购买水果
n=int(input('请输入购买水果的种类数量：'))

#设置sum_price存储总金额
sum_price=0

for i in range(0,n):
    #输入购买的水果名称与数量，存储至fruit与num
    fruit=input('输入购买水果%d的名称：'%(i+1))
    num=int(input('输入购的水果%d的数量(斤)：'%(i+1)))

    #如果输入的水果在price字典中
    if fruit in price:
        #将水果单价price[fruit]乘以购买的数量num累加到sum_price
        sum_price+=price[fruit]*num
print('总价格为%d'%(sum_price))#最后输入总价格sum_price
